<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
/**
* Run the database seeds.
*
* @return void
*/
public function run()
{
$permissions = [
    'لوحة القيادة',

    'القضايا',
    'إضافة قضية جديدة',
    ' عرض القضايا',
    'استرجاع القضايا المشابهة',
    'أرشيف القضايا',
    'عرض القضايا المؤرشفة',

    'المهام',
    'إضافة مهمة جديدة',
    'عرض المهام',

    'العملاء', 
    'إضافة عميل جديد',
    'عرض العملاء',

    'أفراد المكتب',
    'إضافة فرد جديد',
    'عرض الأفراد',

    'عرض تفاصيل قضية',
    'حالة القضية',
    'تفاصيل إضافية',
    'جلسات القضية',
    'مرقفات القضية',
    'القرارات',


    'تعديل قضية',   
    'تعديل معلومات القضية',
    'تغيير حالة القضية',
    'إضافة جلسة جديدة',
    'اختيار مرفقات الجلسة',
    'إضافة مرفق جديد للقضية',
    'عرض القرار',
    'عرض الجلسة',
    'تعديل الجلسة',
    'إضافة قرار',
    'تعديل القرار',

    'بحث بموضوع الدعوى',
    'بحث برقم القضية',
    'بحث بحالة القضية',
    'بحث باسم المحكمة',
    'بحث باسم الموكل',
    'بحث باسم المحامي',
    'بحث بالعام',
    



    
];
foreach ($permissions as $permission) {
 Permission::create(['name' => $permission]);
}
}

}